<template>

	<div class="flex flex-wrap items-center p-4">
		<div v-for="topic in news" class="w-full md:w-1/2 lg:w-full">
			<div class="m-2 border border-gray-300 rounded-lg shadow-lg overflow-hidden" @click="$router.push({name: 'newsitem', params: topic})">
				<div class="flex items-center">
					<img :src="topic.image" alt="" class="h-24 w-24 object-cover flex-shrink-0">
					<div class="px-6 py4">
						<h3 class="text-sm font-semibold text-gray-700 leading-tight">{{topic.title}}</h3>
						<!-- <p class="text-xs text-gray-600 leading-tight">{{topic.text.substring(0,60)+'...'}}</p> -->
					</div>
				</div>
			</div>
			
		</div>
	</div>

</template>
<script>
	export default {
		name: 'news',
		data() {
			return {
				news: [
					{image: "/img/news/gold.png", title: "Звезда «Дом-2» Настя Голд решилась на пластическую операцию", text: "Звезда скандального реалии-проекта «Дом-2» Настя Голд решила, что ей нужно сделать сразу несколько пластических операций. За помощью красотка обратилась к довольно известному пластическому хирургу Павлу Пиманчеву. В преддверии своей свадьбы участница «Дом-2» Настя Голд решила немного изменить свою внешность. В частности, Голд намерена немного увеличить грудь, а также изменить форму носа. Прежде чем лечь под нож хирурга, Настя прошла подробную консультацию. Она объяснила медику, какая именно форма носа ее бы полностью устроила, а также попробовала импланты на ощупь и подобрала те, что необходимы именно ей. К слову, Голд отметила, она рада, что в выборе врача остановилась на Павле. По ее словам, себя она может доверить только профессионалам своего дела. Стоит подчеркнуть, что ранее у этого же доктора делала пластику другая известная участница «Дом-2» Алена Рапунцель. Известно, что операцию Настя Голд намерена провести в ближайшее время."},
					{image: "/img/news/buzovaPB.jpg", title: 'Дата выхода нового клипа Ольги Бузовой уже известна', text: 'Популярная телеведущая пообещала поклонникам подготовить «бомбу на лето». Начинающая певица снова заинтриговала подписчиков предстоящим сюрпризом. Телеведущая проекта «Дом-2» продолжает двигаться вверх по карьерной лестнице, записывая все больше новых песен и клипов. На своей личной странице в соцсети Instagram Ольга выставила короткое видео, снятое на очередных съемках нового клипа. Девушка оставила в тайне название композиции, для которой снимается ролик. Однако она заметила, что премьера видеоролика состоится уже 15 мая. На этом сюрпризы от Ольги Бузовой не закончились и в следующем посте она рассказала о сюрпризе, который якобы будет ожидать ее фанатов летом. Девушка не забыла и пожаловаться на плотный график, на ближайший год ее жизнь распланирована. Напомним, что помимо концертов, Ольга Бузова старается зарабатывать на жизнь как может, подрабатывая ведением телепередач, мероприятий и прочего. Ни для кого не секрет, что с момента появления ее композиций, персона бывшей участницы телепроекта «Дом-2» стала более востребованной.'},
					{image: "/img/news/cherno.jpg", title: 'Звезда «Дом-2» Александра Черно открыто угрожает парню несовершеннолетней сестры', text: 'Совсем недавно в Сети появилась информация о том, что младшая сестра звезды «Дом-2» Александры Черно выходит замуж. Однако выяснилось, что такое решение Татьяны совсем не устраивает саму Александру настолько, что она даже прибегла к крайним мерам. Участница скандального шоу «Дом-2» Александра Черно, которая вот-вот станет мамой, запретила своей младшей сестре выходить замуж. В качестве аргумента она отметила, что девушке пока еще не исполнилось 18 лет. Кроме того, полнотелая красотка сказала, что если ее жених хоть пальцем дотронется до ее сестры, то он будет иметь дело с ней. В очередной раз Черно заговорила и о безответственности своей родственницы. Будущая мамочка напомнила, что она совсем не думает о своем будущем.'},
					{image: "/img/news/sheglova.webp", title: 'Щеглова озвучила причины «войны» с Галимовой', text: 'Девушки перестали общаться. В беседе с Dom2Life.ru Юля Щеглова рассказала, почему они с Алиной Галимовой теперь предпочитают обходить друг друга стороной. Конкурс «Самое красивое тело Острова Любви» подошёл к концу! Заветный титул и 100 тысяч рублей получил Игорь Русанов, обойдя в финале Алину Галимову и Диму Чайкова. В разговоре с Dom2Life.ru Юля Щеглова рассказала, как отреагировала на победу мужа. «Я, наверное, мысли в космос постоянно посылала, чтобы Игорь победил, я очень этого хотела. Но я знала, что кроме него главным претендентом на победу был Дима Чайков»'},
					{image: "/img/news/chikens.jpeg", title: 'Новые участники телепроекта', text: 'Купинские цыплята успешно растут цветут и пахнут.'},
				]
			}
		}
	}
</script>